snlkuharlocal/src/Documents/РасчетЗаказаПоставщику/РасчетЗаказаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетЗаказаПоставщику</name>
  <attributes>
    <name>ДатаПредварительногоЗаполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончательногоЗаполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаЗаказа</name>
    <type>
      <types>EnumRef.ВидыРасчетаЗаказаНаПроизводство</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрофицитКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаВычетомСпаек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроцентСпаекСобираемыхНаСкладе</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентУменьшенияПланов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродукцияСНедостачейКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/РасчетЗаказаПоставщику/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	
	если Модифицированность() тогда
		ЗаполнитьКомплектующие();
	КонецЕсли;
	
КонецПроцедуры  


Процедура ЗаполнитьКомплектующие()  экспорт 
	Запрос = новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТЧ.Номенклатура КАК Номенклатура,
	             |	ТЧ.Количество КАК Количество
	             |ПОМЕСТИТЬ Товары
	             |ИЗ
	             |	&Товары КАК ТЧ	             
	             | ;
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА Товары.Номенклатура.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	             |			ТОГДА ЕСТЬNULL(НоменклатураКоплектующие.Номенклатура, Товары.Номенклатура)
	             |		ИНАЧЕ Товары.Номенклатура
	             |	КОНЕЦ КАК Номенклатура,
	             |	ВЫБОР
	             |		КОГДА Товары.Номенклатура.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	             |			ТОГДА Товары.Количество * ЕСТЬNULL(НоменклатураКоплектующие.Количество, 1)
	             |		ИНАЧЕ Товары.Количество
	             |	КОНЕЦ КАК Количество,
	             |	Товары.Номенклатура КАК Продукция,
	             |	Товары.Количество КАК КоличествоПродукции
	             |ИЗ
	             |	Товары КАК Товары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	             |		ПО Товары.Номенклатура = НоменклатураКоплектующие.Ссылка
	             |			И (НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = Значение(Перечисление.ВидыНоменклаутры.товар))"; 
	запрос.УстановитьПараметр("Товары",товары.Выгрузить());         
	Комплектующие.Загрузить(запрос.Выполнить().Выгрузить());
//|	&Товары КАК ТЧ	
//|	Документ.РасчетЗаказаПоставщику.Товары КАК ТЧ  

КонецПроцедуры
